Documents/ЭлементыОбъектовСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЭлементыОбъектовСистемы</Name>
			<BasedOn>
				<xr:Item>Document.ЭлементыОбъектовСистемы</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Н_ОС_1И_1Р</xr:Item>
				<xr:Item>InformationRegister.С_РР_2И_2Р</xr:Item>
				<xr:Item>InformationRegister.С_РР_2И_1Р</xr:Item>
				<xr:Item>AccumulationRegister.Н_ОБ_1И_1Р</xr:Item>
				<xr:Item>AccumulationRegister.Н_ОБ_5И_3Р_1Р</xr:Item>
				<xr:Item>AccumulationRegister.Н_ОС_5И_3Р_1Р</xr:Item>
				<xr:Item>InformationRegister.С_РР_2И_3Р</xr:Item>
				<xr:Item>InformationRegister.С_РР_5И_3Р_1Р</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлементыОбъектовСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корректировка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлементыОбъектовСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлементыОбъектовСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлементыОбъектовСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбщейТранзакции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЭлементыОбъектовСистемы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ГУИД = XMLСтрока(ТекущийОбъект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСФормойНаСервере.ЗаполнитьФорму(ЭтотОбъект);
	РаботаСФормойНаСервере.НастроитьФорму(ЭтотОбъект, Объект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	РаботаСФормойНаСервере.ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаОсновании(Команда)
	ЗначенияЗаполнения = Неопределено;
	
	Если Команда.Имя = "СоздатьВерсию" Тогда
		ЗначенияЗаполнения = Новый Структура(
		"Команда,			ОбъектСистемы,			ВариантОбъекта,		Наименование,			Основание,			Корректировка,			Версия",
		"СоздатьВерсию",	Объект.ОбъектСистемы,	Объект.ВариантОбъекта,	Объект.Наименование,	Объект.Основание,	Объект.Корректировка,	?(Объект.Версия.Пустая(), Объект.Ссылка, Объект.Версия));
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ОткрытьФорму("Документ.ЭлементыОбъектовСистемы.ФормаОбъекта", ПараметрыФормы);
	ИначеЕсли Команда.Имя = "СоздатьКорректировку" Тогда
		ЗначенияЗаполнения = Новый Структура(
		"Команда,				ОбъектСистемы,			ВариантОбъекта,		Наименование,			Основание,			Корректировка,															Версия",
		"СоздатьКорректировку",	Объект.ОбъектСистемы,	Объект.ВариантОбъекта,	Объект.Наименование,	Объект.Основание,	?(Объект.Корректировка.Пустая(), Объект.Ссылка, Объект.Корректировка),	Объект.Версия);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ОткрытьФорму("Документ.ЭлементыОбъектовСистемы.ФормаОбъекта", ПараметрыФормы);
	Иначе
		Если КомандыКнопок.Свойство(Команда.Имя, ЗначенияЗаполнения) Тогда
			ЗначенияЗаполнения = Новый Структура(
			"Команда,				ОбъектСистемы,						ВариантОбъекта,					Наименование,			Основание",
			"СоздатьНаОсновании",	ЗначенияЗаполнения.ОбъектСистемы,	ЗначенияЗаполнения.ВариантОбъекта,	Объект.Наименование,	Объект.Ссылка);
			ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
			ОткрытьФорму("Документ.ЭлементыОбъектовСистемы.ФормаОбъекта", ПараметрыФормы);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСистемыПриИзменении(Элемент)
	ОбъектСистемыВариантОбъектаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВариантОбъектаПриИзменении(Элемент)
	ОбъектСистемыВариантОбъектаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбъектСистемыВариантОбъектаПриИзмененииНаСервере()
	РаботаСФормойНаСервере.ОчиститьФорму(ЭтотОбъект);
	РаботаСФормойНаСервере.ЗаполнитьФорму(ЭтотОбъект);
	РаботаСФормойНаСервере.НастроитьФорму(ЭтотОбъект, Объект);
КонецПроцедуры
